Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: `Base.cconvert` version. This allows, for example, passing an argv pointer array of type Vector{String} to an argument of type Ptr{Ptr{Cchar}}.
ja: 'Base.チコンベルト'バージョン。これにより、例えば、argvポインタ配列を渡すことができます。 Vector{String}は、Ptr{Ptr{Cchar}}の型を引数にします。

source: `Base.unsafe_convert` handles conversion to `Ptr` types.
ja: 'Base.unsafe_convert'は、`Ptr'型への変換を処理する。

source: `Base.unsafe_convert` handles conversion to `Ptr` types. It is considered unsafe because converting an object to a native pointer can hide the object from the garbage collector, causing it to be freed prematurely.
ja: 'Base.unsafe_convert'は、`Ptr'型への変換を処理します。安全ではないと考えられます。 オブジェクトをネイティブ・ポインタに変換すると、ガーベッジ・コレクターからオブジェクトを非表示にすることができます。 早期に解放することです。

source: `BitArray`s are space-efficient "packed" boolean arrays, which store one bit per boolean value.
ja: 「BitArray」は、ブール値ごとに1ビットを格納するスペース効率の高い「パックされた」ブール演算配列です。

source: `BitArray`s are space-efficient "packed" boolean arrays, which store one bit per boolean value. They can be used similarly to Array{Bool} arrays (which store one byte per boolean value), and can be converted to/from the latter via Array(bitarray) and BitArray(array), respectively.
ja: 「BitArray」は、ブール値ごとに1ビットを格納するスペース効率の高い「パックされた」ブール演算配列です。 これらは、Array{Bool}配列(ブール値ごとに1バイトを格納する)と同様に使用できます。 また、アレイ(bitarray)およびBitArray(配列)を介して、後者との間で変換を行うことができます。

source: `CartesianIndex{N}`s, which behave like an N-tuple of integers spanning multiple dimensions (see below for more details)
ja: 「CartesianIndex{N}」は、複数の次元を超える整数のNのように動作します(詳細については以下を参照)。

source: `Colon()` (:), which represents all indices within an entire dimension or across the entire array
ja: 「コロン()」(:)は、全次元または配列全体にわたってすべてのインデックスを表します。

source: `Dict` is the standard dictionary.
ja: 「Dict」は標準辞書です。

source: `Dict`s can be created by passing pair objects constructed with => to a `Dict`
ja: 「Dict」は、=>で構成されたペアオブジェクトを、'Dict'に渡すことで作成できます。

source: `IdDict` is a special hash table where the keys are always object identities.
ja: 「IdDict」は、鍵が常にオブジェクト識別子である特殊なハッシュ表です。

source: `Inf` and `NaN` propagate through complex numbers in the real and imaginary parts of a complex number as described in the Special floating-point values section:
ja: 「Inf」と'NaN'は、実部と虚部の複素数を通して伝搬する。 の特殊浮動小数点値セクションで記述された複雑な数値の値です。

source: `Ptr`) as a "scalar".
ja: 「Ptr」は「スカラー」である。

source: `WeakKeyDict` is a hash table implementation where the keys are weak references to objects, and thus may be garbage collected even when referenced in a hash table.
ja: 「WeakKeyDict」はハッシュ表の実装で、鍵はオブジェクトへの弱い参照であり したがって、ハッシュ・テーブルで参照されている場合でも、ガーベッジ・コレクションを収集することができます。

source: `cglobal` are a symbol specification identical to that used by `ccall`, and a type describing the value stored in the variable:
ja: 'cglobal'は、使用されたものと同じシンボル仕様です。 'ccall'によって、変数に格納された値を記述するタイプが次のようになります。

source: `chr2ind(str,j)` gives the index at which the jth character in str occurs.
ja: `chr2ind(str,j)` は str の j 番目の文字が格納されているインデックスの値を返します。

source: `copy` and other out-of-place operations.
ja: 「コピー」およびその他の場所 操作。

source: `copy` and other out-of-place operations. No matter how an AbstractArray{T,N} is represented internally, T is the type of object returned by integer indexing (A[1, ..., 1], when A is not empty) and N should be the length of the tuple returned by `size`. For more details on defining custom AbstractArray implementations, see the (@ref man-interface-array).
ja: 「コピー」およびその他の場所 オペレーションは、AbstractArray{T,N}が内部的に表されても、Tはタイプである。 整数インデックス(A[1,.…,1],)はAであり、Nはnである。 `size'によって返されるタプルの長さ。カスタムの定義についての詳細は AbstractArray実装を参照してください。(@ref man interface array)を参照してください。

source: `endof(str)` gives the maximal (byte) index that can be used to index into str.
ja: `endof(str)` は str へのインデックス付けに使用できる最大の（バイト）インデックスを返します。

source: `eval` and effects
ja: `eval`とエフェクト

source: `hvcat` concatenates in both dimension 1 (with semicolons) and dimension 2 (with spaces).
ja: 「ホフカト」は、次元1(セミコロン)と次元2(スペースを含む)の両方で連結されます。

source: `hvcat` concatenates in both dimension 1 (with semicolons) and dimension 2 (with spaces). Consider these examples of this syntax:
ja: 「ホフカト」は、次元1(セミコロン)と次元2(スペースを含む)の両方で連結されます。 この構文の例を次に示します。

source: `ind2chr(str,i)` gives the number of characters in str up to and including any at index i.
ja: `ind2chr(str,i)`は、文字列strの、インデックス1からインデックスiまでに格納されている文字数を返します。

source: `isequal()` considers NaNs equal to each other:
ja: `isequal()` は、NaN 同士は等しいと解釈します。:

source: `isequal` considers NaNs equal to each other:
ja: 「isequal」は、NaNを互いに等しいとみなします:

source: `isequal` to determine equality.
ja: 等価を決定するには、「isequal」を指定します。

source: `length(iter)`
ja: `length(iter)``length(iter)`

source: `length(str)` the number of characters in str.
ja: `length(str)`は str.の文字数を返します。

source: `parse` function, which takes a string of Julia code and returns the corresponding Expr.
ja: 'parse'関数は、Juliaコードの文字列を取得して、対応する Expr。

source: `push!`ing each element into a Vector{Any}:
ja: 「プッシュ!」各要素をベクトル{Any}に押し込みます。

source: `setprecision()` and `setrounding()`, and all further calculations will take these changes in account.
ja: `setprecision()`および `setrounding()`を使用することで設定変更が可能です。設定変更後の演算は全てこの変更が反映されます。

source: `setprecision` and `setrounding`, and all further calculations will take these changes in account.
ja: 'setprecision'および'セロウンディング' さらに計算を行うと、これらの変更は考慮されます。

source: `string()` is the identity for AbstractString and Char values, so these are interpolated into strings as themselves, unquoted and unescaped:
ja: `string()`は AbstractString および Char値と同一です。そのため、これらはクオーテーションが付かず、 エスケープもされずにそのまま文字列に補間されます。:

source: `view` function, which is called the same way as `getindex` (with an array and a series of index arguments).
ja: 「view」関数は、以下と同じ方法で呼び出されます。 `getindex'(配列と一連のインデックス引数を持つ)。

source: `view` function, which is called the same way as `getindex` (with an array and a series of index arguments). The result of `view` looks the same as the result of `getindex`, except the data is left in place. `view` stores the input index vectors in a SubArray object, which can later be used to index the original array indirectly. By putting the `@views` macro in front of an expression or block of code, any array[...] slice in that expression will be converted to create a SubArray view instead.
ja: 「view」関数は、以下と同じ方法で呼び出されます。 `getindex'(配列と一連のインデックス引数を持つ)。結果 'view'は、'getindex'の結果と同じであるが データは所定の場所に残されます。'view'は、入力インデックスベクトルを格納します。 サブアレイオブジェクトで、後でオリジナルの配列をインデックス化するために使用できます。 間接的には、`@views`マクロを式の前に置くか、または コードのブロック、任意の配列[.]スライスは、その式の中に変換されます。 代わりにサブアレイを作成ビューを作成します。

source: a += b) are parsed as a .= a .+ b, where .= is a fused in-place assignment operation (see the (@ref man-vectorized)).
ja: +=b)は解析されます。 a.=a.+b。ここで=は、であり、は、のインプレースである。 ((@ref man vectorized))を参照してください。

source: a BitArray with all values false
ja: BitArrayであり、すべての値はfalseである。

source: a Symbol identifying the kind of expression.
ja: 記号で、表現の種類を識別します。

source: a `BitArray` with all values true
ja: 'BitArray'はすべての値が真である

source: a function pointer (for example, from dlsym).
ja: 関数ポインタ(たとえば、dlsymからの関数ポインタです)。

source: a positive value with the magnitude of x
ja: x の大きさの、正の値

source: a range expressing the valid indices along dimension n
ja: 寸法nに沿って有効なインデックスを表現する範囲

source: a return type of Ref{Any} is invalid, it should either be Any (corresponding to jl_value_t*) or Ptr{Any} (corresponding to jl_value_t**)
ja: Ref{Any}の戻り値が無効です。Any(jl_value_t*に対応します) またはPtr{Any}(jl_value_t**に対応する)

source: a tuple containing the dimensions of A
ja: Aの次元を含むタプル

source: a tuple containing the valid indices of A
ja: Aの有効なインデックスを含むタプル

source: a tuple of the strides in each dimension
ja: 各次元の上昇点の集合

source: a value greater than all finite floating-point values
ja: 全ての有限の浮動小数点値よりも大きい値

source: a value less than all finite floating-point values
ja: 全ての有限の浮動小数点数値よりも小さい値

source: a value not == to any floating-point value (including itself)
ja: 浮動小数点値(自身を含む)に対して==ではない値

source: a value with the magnitude of x and the sign of x*y
ja: xの大きさで、x*yと同じ符号を持つ値

source: a value with the magnitude of x and the sign of y
ja: xの大きさで、yと同じ符号を持つ値

source: a and b, and `maximum(a)`, which finds the largest value within a.
ja: およびb、の最大値(a)は、最も大きい値を示します。 a。

source: a and b, and `maximum(a)`, which finds the largest value within a. The same relationship holds for min.(a,b) and minimum(a).
ja: およびb、の最大値(a)は、最も大きい値を示します。 。min(a,b)と最小(a)と同じ関係が成り立つ。

source: a at expression construction time is used as an immediate value in the expression.
ja: 式の構築時のは、次のように直接値として使用されます。 で指定します。

source: access named fields in objects/modules (calling (@ref Base.getproperty) or (@ref Base.setproperty!)), also prefixes elementwise function calls (calling `broadcast`)
ja: オブジェクト/モジュールの名前付きフィールド(呼び出し(@ref Base.getproperty)または(@ref Base.setproperty!))は、要素関数呼び出し(ブロードキャスト")を呼び出します。

source: accurate exp(x)-1 for x near zero
ja: 0に近い x に対する、 exp(x)-1 の正確な値

source: accurate log(1+x) for x near zero
ja: 0に近い x に対する、正確な log(1+x)の値

source: accurate log(beta(x,y)) for large x or y
ja: 大きな値 x または y に対する正確な log(beta(x,y))の値

source: accurate log(factorial(x)) for large x; same as lgamma(x+1) for x > 1, zero otherwise
ja: 大きな値 x に対する log(factorial(x))の正確な値； x > 1に対して lgamma(x+1) と同じ。（でなければ0）

source: accurate log(gamma(x)) for large x
ja: 大きな値 x に対する log(gamma(x)) の正確な値

source: an Array filled with the value x
ja: xの値で満たされた配列

source: an Array of all ones
ja: 全てのアレイ

source: an Array of all zeros
ja: すべてのゼロの配列

source: an Array with random, iid and uniformly distributed values in the half-open interval [0, 1)
ja: 配列で、ランダムなiidで、半オープン間隔[0 1]で均一に分布した値を示す。

source: an Array with random, iid and standard normally distributed values
ja: ランダムなiidと標準的な正規分布の値を持つ配列

source: an array containing the same data as A, but with different dimensions
ja: Aと同じデータを含む配列であるが、異なる次元を含む配列

source: an array with the same binary data as A, but with element type T
ja: Aと同じバイナリデータを持つ配列であるが、要素タイプTである。

source: an efficient iterator for visiting each position in A
ja: Aの各位置を訪問するための効率的なイテレータ

source: an uninitialized array of the same type as A (dense, sparse, etc.), but with the specified element type and dimensions.
ja: A(密、疎等)と同じタイプの初期化されていない配列ですが、指定されたエレメントタイプとディメンションがあります。

source: an uninitialized array of the same type as A (dense, sparse, etc.), but with the specified element type and dimensions. The second and third arguments are both optional, defaulting to the element type and dimensions of A if omitted.
ja: A(密、疎など)と同じタイプの初期化されていない配列ですが、指定された要素タイプと次元があります。2番目と3番目の引数は両方ともオプションで、<x/>Aの要素タイプと次元は省略されます。

source: an uninitialized dense `Array`
ja: 初期化されていない密な`配列"

source: and can cause especial headaches with (@ref man-multi-dim-arrays):
ja: また、(@ref man multi dim arrayS)で特別な頭痛を引き起こす可能性があります。

source: and can cause especial headaches with Arrays:
ja: これは、 配列Arraysと共に理解に苦しむものかもしれません。

source: and digits (0-9 and other characters in categories Nd/No), as well as other Unicode code points: diacritics and other modifying marks (categories Mn/Mc/Me/Sk), some punctuation connectors (category Pc), primes, and a few other characters.
ja: ！や数字（0から9とNd･Noカテゴリ内のその他の記号）、その他のUnicode符号点 （発音区別符号およびその他の修飾文字（Mn/Mc/Me/Skカテゴリ）、句読点コネクタ（Pcカテゴリ）、 プライム記号、その他の文字）を使用することができます。

source: and gets 2d15fe94-a1f7-436c-a4d8-07a9a496e01c, which indicates that in the context of the Pub package, import Priv refers to the public Priv package, rather than the private one which the app depends on directly.
ja: 2d15fe94-a1f7-436c-a4d8-07a9a496e01cを取得します。Pubパッケージのコンテキストでは、Import Privは、アプリケーションが直接依存するプライベートではなく、publicPrivパッケージを指します。

source: and then
ja: そして

source: argument value must be a valid Julia object
ja: 引数の値は有効なJuliaオブジェクトでなければなりません

source: argument value must be a valid Julia object (or C_NULL)
ja: 引数の値は有効なジュリアオブジェクトでなければなりません(またはC_NULL)。

source: argument value will be copied (passed by value)
ja: 引数の値がコピーされます(値によって渡されます)。

source: argument value will be copied (returned by-value)
ja: 引数の値がコピーされます(値によって返されます)

source: argument value will be copied if it is an isbits type otherwise, the value must be a valid Julia object
ja: 引数の値は、イスビトスの場合はコピーされます。それ以外の場合は、有効なジュリアである必要があります。 オブジェクト

source: arithmetic shift right
ja: 算術右桁送り

source: as well as the negation on `Bool` types:
ja: `Bool`(@ref) 型の否定形についても同様。

source: at the end of a function name, ! is used as a convention to indicate that a function modifies its argument(s)
ja: 関数名の最後に、!は関数がその引数を変更することを示す規則として使用されます。

source: backslash operator
ja: バックスラッシュ演算子

source: bar(x::Integer) = x ^ 2 will do the same thing, but it is both simpler and faster.
ja: bar(x::Integer)=x^2は同じことを行いますが、どちらもより単純で速くなります。

source: base 10 logarithm of x
ja: 10 を底とした xの対数

source: base 2 logarithm of x
ja: 2 を底とした xの対数

source: base b logarithm of x
ja: b を底とした xの対数

source: begin multi-line comment (these are nestable)
ja: 複数行コメントを開始します(これらはnestableです)。

source: begin single line comment
ja: 単一行コメントを開始する

source: beta function at x,y
ja: x,y に対する ベータ関数

source: binary exponent of x
ja: 2の x乗

source: binary minus
ja: ２項減算

source: binary plus
ja: ２項加算

source: bitwise and
ja: ビット毎の論理積

source: bitwise not
ja: ビット毎の論理否定

source: bitwise not operator
ja: ビット単位の演算子

source: bitwise or
ja: ビット毎の論理和

source: bitwise xor (exclusive or)
ja: ビット単位のXOR (排他的論理和)

source: bitwise xor operator
ja: ビット単位のXOR演算子

source: break statement inside such a loop exits the entire nest of loops, not just the inner one.
ja: このようなループ内のbreakステートメントは、内部だけではなくループのネスト全体を終了させます。

source: broadcast(f, args...), providing a convenient syntax to broadcast any function ((@ref man-vectorized)).
ja: ブロードキャスト(f,args.)は、任意の関数をブロードキャストするための便利な構文を提供します。 ((@ref man-vectorized))。

source: broadcast(f, args...), providing a convenient syntax to broadcast any function ((@ref man-vectorized)). Nested "dot calls" f.(...) (including calls to .+ etcetera) (@ref man-dot-operators) into a single broadcast call.
ja: ブロードキャスト(f,args.)は、任意の関数をブロードキャストするための便利な構文を提供します。 ((@ref man vectorized))ネストされた"ドットコール"f.(...)(.+eteteraへの呼び出しを含む) (@ref man dot演算子)は、単一のブロードキャスト・コールに対して使用されます。

source: but
ja: しかし

source: ccall(sym, ...) Use the pointer `sym` instead of the (symbol, library) tuple (remaining arguments are the same).
ja: ccall(sym, ...)(シンボル、ライブラリ)タプルの代わりにポインタ`sym'を使用します(残りの引数は同じです)。

source: ccall / @cfunction argument translation guide
ja: ccall/@cfunction引数変換ガイド

source: ceiling division; quotient rounded towards +Inf
ja: 天井整商; +Inf に向かって丸めた商

source: changes true to false and vice versa
ja: trueをfalseに変える。または、その逆。

source: char* to a C routine that does not assume NUL termination (e.g. because you pass an explicit string length), or if you know for certain that your Julia string does not contain NUL and want to skip the check, you can use Ptr{UInt8} as the argument type.
ja: char*はNUL終了を想定していないCルーチンに対して(例えば明示的なものを渡すなど) 文字列の長さ)、またはJulia文字列にNULが含まれていないことがわかっている場合は このチェックをスキップするには、引数のタイプとしてPtr{UInt8}を使用できます。

source: clock takes no arguments and returns an `Int32`.
ja: クロックは引数を取らず、`Int32`を返します。

source: clock takes no arguments and returns an `Int32`. One common gotcha is that a 1-tuple must be written with a trailing comma. For example, to call the getenv function to get a pointer to the value of an environment variable, one makes a call like this:
ja: clockは引数を取らず、`Int32`を返します。1つの一般的なgotchaは1タプルを必要とします。 は、次のように記述されます。たとえば、getenv関数を呼び出してポインタを取得するには、次のようにカンマで区切ります。 環境変数の値は、次のような呼び出しを行います。

source: complex transpose operator Aᴴ
ja: 複素転置演算子Aᴴ

source: concatenate input arrays along dimension(s) k
ja: 次元に沿って入力配列を連結するk

source: copy A, recursively copying its elements
ja: Aをコピーして、その要素を再帰的にコピーする

source: cube root of x
ja: xの立方根

source: currently unsupported by @cfunction
ja: 現在は@cfunctionによってサポートされていません。

source: defined in terms of scalar getindex
ja: スカラーgetindexの観点から定義されている

source: defined in terms of scalar setindex!
ja: スカラーsetindex!の観点から定義されます。

source: delimit character literals
ja: 文字リテラルを区切る

source: delimit external process (command) specifications
ja: 外部プロセス(コマンド)仕様の境界指定

source: delimit string literals
ja: 文字列リテラルを区切る

source: den::T indicate that the data held in a OurRational{T} object are a pair of integers of type T, one representing the rational value's numerator and the other representing its denominator.
ja: den::Tは、OurRational{T}オブジェクトに保持されたデータが、型の整数のペアであることを示します。 T。有理値の分子を表し、もう一方は分母を表します。

source: depends on how this parameter is used, first translate this to the intended pointer type, then determine the Julia equivalent using the remaining rules in this list
ja: このパラメータがどのように使用されるかによって異なります。まず、このパラメータを目的のポインタ・タイプに変換します。 このリストの残りのルールを使用して、Julia equivalentを決定します。

source: dest or the specific subtype of bc, to avoid ambiguities between packages we recommend the following convention.
ja: destまたはbcの特定のサブタイプ パッケージ間の曖昧さを避けるために、次の規則が推奨されています。

source: dims argument (ordinarily a Dims size-tuple) can accept AbstractUnitRange objects, perhaps range-types Ind of your own design.
ja: 引数(通常はDimmsサイズのタプル)はAbstractUnitRangeオブジェクトを受け入れることができます。 独自の設計では、おそらく範囲のタイプはIndです。

source: divide
ja: 除算

source: does appear in the manifest file.
ja: はマニフェストファイルに表示されます。

source: end multi-line comment
ja: 複数行コメント

source: equality
ja: 等しい

source: equivalent to --code-coverage=user
ja: --code coverage=user

source: equivalent to --track-allocation=user
ja: に相当する--トラック割り当て=ユーザ

source: equivalent to rem(x,y)
ja: rem(x,y)と同等

source: equivalent to y / x
ja: y/xと同等

source: eval only operates at the top level, so within this expression local variables will not be available (unless their values are substituted with $).
ja: evalは最上位レベルでのみ動作します。 この式では、ローカル変数は使用できません(値が代入されない限り)。 $となります。

source: expm1, log1p, erfc, and hypot.
ja: expm1、 log1p、erfc および hypot に関するJohn D. Cookのブログ記事を参照してください。

source: exponent operator
ja: 指数演算子

source: f.(args...) calls are fused into a single broadcast loop.
ja: f.(args.…)コールは、の融合を単一のブロードキャスト・ループに融合させます。

source: f.(args...) calls are encountered.
ja: f.(args.)呼び出しが検出されました。

source: f and args, describing the function and argument list, respectively.
ja: fとargsは、関数と引数リストをそれぞれ記述しています。

source: fill the array A with the value x
ja: xの値を持つ配列Aを配列に埋め込みます。

source: floored division; quotient rounded towards -Inf
ja: 床整商; -Inf に向かって丸めた商

source: free(ptr) when the returned Array object is finalized.
ja: 返されたアレイオブジェクトがファイナライズされたときに、フリー(ptr)。

source: from the REPL work as expected, being able to both see and call the new definition of newfun.
ja: newfunへの REPLからの今後の呼び出しは、期待通りに動作し、newfunの新しい定義を参照して呼び出すことができます。

source: gamma function at x
ja: x に対する ガンマ関数n

source: getenv C library function is wrapped in the following Julia function, which is a simplified version of the actual definition from `env.jl`:
ja: getenvCライブラリ関数は、次のJulia関数にラップされています。 これは、'env.jl'からの実際の定義の簡略化されたバージョンです。

source: greater than
ja: より大きい

source: greater than or equal to
ja: 以上

source: greatest positive common divisor of x, y,...
ja: x 、y 、...の正の最大公約数

source: gsl_permutation, that has no internal fields and whose sole purpose is to be placed in the type parameter of a Ptr type.
ja: gsl remutation は、内部フィールドを持たず、その唯一の目的は Ptr型。

source: hn = Vector{UInt8}(undef, 256) err = ccall(:gethostname, stdcall, Int32, (Ptr{UInt8}, UInt32), hn, length(hn))
ja: hn=Vector{UInt8}(undef,256) err=ccall(:gethostname,stdcall,Int32,(Ptr{UInt8},UInt32),hn,長さ(hn))

source: hypotenuse of right-angled triangle with other sides of length x and y
ja: 長さ x and yの辺を持つ直角三角形の斜辺

source: if T is an enum, the argument type should be equivalent to Cint or Cuint
ja: Tがenumの場合、引数のタイプはCintまたはCuintと同等である必要があります。

source: in C:
ja: C:

source: in Julia:
ja: ジュリア:

source: index an entire dimension (firstindex:lastindex), see `Colon`)
ja: 索引全体(firstindex:lastindex)をインデックス化します。`コロン`を参照してください。

source: indicates that Tuple "wins" over zero-dimensional arrays (the output container will be a tuple).
ja: タプル"が0次元配列に対して(出力コンテナはタプルになります)"勝ち"であることを示します。

source: indicates the sign of x, returning -1, 0, or +1
ja: x の符号を示し、 -1、 0、 または +1を返す

source: indicates whether the sign bit is on (true) or off (false)
ja: 符号ビットがオン（true）またはオフ（false）であるかを示す

source: inequality
ja: 異なる

source: integer divide
ja: 整商

source: inverse divide
ja: 左除算

source: invoke macro m; followed by space-separated expressions
ja: 呼び出しマクロm;それに続く空間的に区切られた式

source: is equivalent to
ja: は以下と同等です。

source: is translated into:
ja: は次のように変換されます。

source: isequal() can also be used to distinguish signed zeros:
ja: isequal() は符号付き0を区別するためにも使用することができます。

source: iterate
ja: 繰り返し

source: jl_value_t* pointers, as Ptr{Cvoid}, by calling `pointer_from_objref(v)`.)
ja: jl_value_t*ポインタはPtr{Cvoid}、'ポインタ_from_objref(v)`を呼び出します。

source: least positive common multiple of x, y,...
ja: x 、y 、...の正の最小公倍数

source: less than
ja: より小さい

source: less than or equal to
ja: 以下

source: logical shift right
ja: 論理右桁送り

source: logical/arithmetic shift left
ja: 論理/算術左桁送り

source: m-by-n identity matrix
ja: m-by-n識別マトリクス

source: mantissa) of a floating-point number x
ja: 浮動小数点数 x に対する 2進仮数 (significand すなわち mantissa)

source: maps values to their additive inverses
ja: 値を加法の逆元と関連付ける

source: meaning
ja: 意味

source: min.(x,y), for elementwise operations over arrays or mixtures of arrays and scalars (a Broadcasting operation); these have the additional advantage of "fusing" into a single loop when combined with other dot calls, e.g. sin.(cos.(x)).
ja: (x,y)配列またはアレイの混合物を構成する要素演算に対して<x x1/> スカラー(ブロードキャストオペレーション);これらは追加の利点を有する。 他のドット呼び出し(例えばsin.(cos.(x)))と組み合わされた場合、単一ループへの「融合」。

source: mod() with offset 1; returns r∈(0,y] for y>0 or r∈[y,0) for y<0, where mod(r, y) == mod(x, y)
ja: オフセットが1の mod() ； mod(r, y) == mod(x, y)の場合、 y>0 なら r∈(0,y] を、y<0ならに r∈[y,0) を返す

source: mod with offset 1; returns r∈(0,y] for y>0 or r∈[y,0) for y<0, where mod(r, y) == mod(x, y)
ja: (r, y)==mod(x, y)0 0

source: modulus with respect to 2pi; 0 <= mod2pi(x) < 2pi
ja: 2piを法とする剰余； 0 <= mod2pi(x) < 2pi

source: modulus; satisfies x == fld(x,y)*y + mod(x,y); sign matches y
ja: 剰余； x == fld(x,y)*y + mod(x,y);を満たす；符号は y と一致

source: multiply, or matrix multiply
ja: 乗算する、または行列乗算する

source: mycompare, which will allow you to see the comparisons that qsort is performing (and to verify that it is really calling the Julia function that you passed to it).
ja: qsortが実行されている比較を表示するためのミコンパレ (そして、それが渡されたJulia関数を実際に呼び出していることを確認するためです)。

source: n worker processes, while --machine-file file will launch a worker for each line in file file.
ja: -p n でn個のワーカーを追加で起動することができ、 --machinefile file では file ファイルの各行ごとにワーカーが起動されます。

source: n worker processes, while --machinefile file will launch a worker for each line in file file.
ja: -p n でn個のワーカーを追加で起動することができ、 --machinefile file では file ファイルの各行ごとにワーカーが起動されます。

source: natural exponential function at x
ja: x の自然な指数関数

source: natural logarithm of x
ja: xの自然対数

source: negation
ja: 否定

source: negative infinity
ja: 負の無限大

source: not a number
ja: 非数値

source: not supported by ccall or @cfunction
ja: ccallまたは@cfunctionではサポートされていません。

source: note A C function declared to return Cvoid will return the value nothing in Julia.
ja: メモ Cvoidを返すことを宣言したC関数は、ジュリアでは何も返さないの値を返します。

source: note An updating operator rebinds the variable on the left-hand side.
ja: note 更新機能の結果は、左辺にある変数に紐付きます。

source: note C functions that take an argument of the type char** can be called by using a Ptr{Ptr{UInt8}}
ja: メモ char**という型の引数をとるC関数は、Ptr{Ptr{UInt8}}を使って呼び出すことができる。

source: note For wchar_t* arguments, the Julia type should be `Cwstring` (if the C routine expects a NUL-terminated string) or Ptr{Cwchar_t} otherwise.
ja: メモ wchar_t*引数に対しては、Julia型は`Cwstring'(もしCルーチンがあると想定した場合)でなければなりません。 string)またはPtr{Cwchar_t}それ以外の場合。

source: note For Fortran functions taking variable length strings of type character(len=*) the string lengths are provided as hidden arguments.
ja: メモ Fortran関数の長さが文字(len=*)の可変長文字列を持つ場合は、文字列の長さを指定します。 は、隠し引数として提供されています。
